void main(String[] args) {
    System.out.println();
    System.out.println("""
            ======================================
                      ИГРА МИЛЛОНЕР
            ======================================
            """);
    menu();

}

static boolean question(String text, int answer) {
    Scanner scanner = new Scanner(System.in);
    System.out.println(text);
    System.out.print("Ответ: ");
    int isanswers = scanner.nextInt();
    if (isanswers == answer) {
        System.out.println("ПОЗДРАВЛЯЮ! Вы ответили правильно +1000$ ");
        System.out.println();
        return true;
    } else
        System.out.println("НЕПРАВИЛЬНО");
    System.out.println("ВЫ ПРОИГРАЛИ");
    return false;
}


static void menu() {
    int balance = 0;
    if (question("""
            Какая самая высокая гора в мире?
            
            1. Килиманджаро
            2. Эльбрус
            3. Мауна-Кеа
            4. Эверест
            """, 4))
    {
        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");

    }else
        return;

    if (question("""
            Кто написал знаменитую пьесу "Ромео и Джульетта"?
            
            1. Лев Толстой
            2. Уильям Шекспир
            3. Антон Чехов
            4. Данте Алигьери""", 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    }else
        return;
    if (question("""
            Какая страна является самой большой  в мире?
            
            1. Россия
            2. Канада
            3. Китай
            4. США
            """, 1))
    {

        {
            balance +=1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    } else
        return;
    if (question("""
            Какой город является столицей Японии?
            
            1. Осака
            2. Токио
            3. Киото
            4. Нагасаки
            """, 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    } else
        return;
    if (question("""
            Какой элемент периодической таблицы обозначается буквой "O"?
            
            1. Кислород
            2. Озон
            3. Олово
            4. Осмий""", 1))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    } else
        return;
    if (question("""
            какой химический элемент в периодической таблице обозначается символом “Au”?
            
            1. Алюминий
            2. Золото
            3. Серебро
            4. Медь
            """, 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    }else
        return;
    if(question("""
             Кто автор романа "Война и мир"?
            
            1. Фёдор Достоевский
            2. Лев Толстой
            3. Михаил Лермонтов
            4. Антон Чехов
            """, 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    }else
        return;
    if (question("""
            Какое самое высокое здание в мире?
            
            1. Бурдж-Халифа
            2. Останкинская башня
            3. Эйфелева башня
            4. Шанхайская башня
            """, 1))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    }else return;
    if (question("""
            Какая река является самой длинной в мире?
            
            1. Нил
            2. Амазонка
            3. Янцзы
            4. Миссисипи
            """, 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
    }else
        return;
    if (question("""
            Кто написал оперу "Кармен"?
            
            1. Джузеппе Верди
            2. Жорж Бизе
            3. Вольфганг Амадей Моцарт
            4. Рихард Вагнер
            """, 2))
    {

        {
            balance += 1000;
        }
        System.out.println("💰 " + "Ваш баланс: " + balance + "$");
        System.out.println("""
                            ========================
                            ПОЗДРАВЛЯЮ! ВЫ ПОБЕДИЛИ!
                            ========================
                            """);
    }else
        return;

}
